        IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG01.
      ******************************************************
      ***   AREA DE COMENTARIOS - REMARKS
      ***   OBJETIVO DO PROGRAMA = MOSTRAR A STRING HELLO
      ***   AUTOR: DANIEL ZAMBON
      ***   DATA : 05/06/2023
      ******************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORD'.
           STOP RUN.
